app/graphql/mutations/create_product.rb

INSERT INTO "products" ("title", "price", "description", "imageUrl", "country", "color", "material", "weight", "dimension", "category", "purpose", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def resolve(
    title:,
    price:,
    description:,
    imageUrl:,
    country:,
    color:,
    material:,
    weight:,
    dimension:,
    category:,
    purpose:,
    quantity:
  )
    product = Product.new(
      title: title,
      price: price,
      description: description,
      imageUrl: imageUrl,
      country: country,
      color: color,
      material: material,
      weight: weight,
      dimension: dimension,
      category: category,
      purpose: purpose,
      quantity: quantity
    )
    if product.save