app/graphql/types/query_type.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
   def product(id:)
    Product.find(id)